{
  "title": "Portfolio",
  "subtext": "Further down, you can find the best projects that I have participated in order of importance.",
  "contents": [
    {
      "title": "Bachelor Thesis",
      "text": [
        "My Bachelor Thesis was composed during my Erasmus exchange on the subject of ",
        "<strong>\"Measuring Parent Centrality in Java Packages\"</strong>. The supervisor was Prof. Paris Avgeriou ",
        "from the University of Groningen. In particular, the thesis implements a well-known metric among ",
        "software engineers, <strong>Parent Centrality</strong>, inside an existing tool, <strong>ASTracker</strong>. ",
        "Moreover, the paper interprets the results to conclude if this metric is useful.",
        "<br>",
        "Experts in software engineering are aware of the fact that inside the source code of a program, ",
        "some specific components may cause problems while maintaining or expanding it. Parent Centrality metric ",
        "that H. A. Al-Mutawa has proposed points out that if additional characteristics exist in these \"harmful\" ",
        "components, it turns them into \"harmless\" ones.",
        "<br>",
        "After analyzing a set of open-source Java projects, we confirmed H. A. Al-Mutawa's claim by matching our ",
        "results with his."
      ],
      "href": {
        "message": "Please find my thesis file (only in english):",
        "fa": "<i class='fas fa-file-pdf'></i>",
        "link": "portfolio/Bachelor Thesis.zip"
      },
      "date": "February 2020 - June 2020"
    },
    {
      "title": "<img src='assets/img/octopus.png' alt='Octopus Logo' style='height: 35px'> Octopus",
      "text": [
        "\"Octopus\" application is an incident management system geared towards small companies. Every user ",
        "is part of one or more groups in order to acquire specific capabilities inside the program. Furthermore, ",
        "users can perform, depending on their privileges, the actions below:",
        "<ul>",
        "<li>Incident and Request Management (Submission, Case Monitoring, Completion)</li>",
        "<li>Statistics Monitoring</li>",
        "<li>Chatting between Users</li>",
        "<li>Group and Privileges Creation</li>",
        "<li>Log Files Surveillance</li>",
        "</ul>",
        "<br>",
        "It is offered as SaaS and was created using the \"Laravel\" programming language for advanced ",
        "security.",
        "<br>",
        "<br>",
        "The application was built in collaboration with ",
        "<a href='https://nmanoukidis.netzapping.gr/' target='_blank' class='text-info'>Nikolaos Manoukidis</a>."
      ],
      "href": {
        "message": "Find more information about the project:",
        "fa": "<i class='fas fa-external-link-alt'></i>",
        "link": ""
      },
      "date": "November 2020 - Now"
    },
    {
      "title": "On Duty Hospitals Website (Flask)",
      "text": [
        "Bachelor level project during \"Web Information Systems\" course. The goal of the project is the creation ",
        "of a website, which represents in real time, all the on-duty hospitals of Greece, as well as their contact ",
        "details. Moreover, the user has the opportunity to find information about COVID-19."
      ],
      "href": {
        "message": "Please, find more information about the project:",
        "fa": "<i class='fas fa-external-link-alt'></i>",
        "link": "https://theathral.github.io/WebInformationSystems/"
      },
      "date": "May 2020"
    },
    {
      "title": "PERT Diagram & Economic Analysis of Project",
      "text": [
        "Bachelor level project during \"Software Systems Quality Assurance\" course. The goal of the project is ",
        "the designing of a PERT diagram showing the construction of a project, using given construction times of the ",
        "individual projects, as well as the analysis of the results.",
        "<br>",
        "The second exercise of the project refers to the selection and economic analysis of two big projects, ",
        "based on the \"Return on Investment\" value after 7 years."
      ],
      "href": {
        "message": "Please find the pronunciation and the solution of the project (only in greek):",
        "fa": "<i class='fas fa-file-pdf'></i>",
        "link": "portfolio/PERT Project.zip"
      },
      "date": "December 2019"
    },
    {
      "title": "Leakage Discovery in Manholes (CLIPS)",
      "text": [
        "Bachelor level project during \"Knowledge Systems\" course. The goal of the project is the creation of an ",
        "expert system using CLIPS, which deduces the location of a malfunction at a factory from a series of ",
        "measurements, that are entered into the program. Moreover, it constructs a given topology of manholes and ",
        "warehouses, as well as the characteristics of some chemicals, so that the program comes to a reliable ",
        "conclusion."
      ],
      "href": {
        "message": "Please, find more information about the project:",
        "fa": "<i class='fas fa-external-link-alt'></i>",
        "link": "https://theathral.github.io/manholeCLIPS/"
      },
      "date": "December 2019"
    },
    {
      "title": "Maze Solution (JADE)",
      "text": [
        "Bachelor level project during \"Multi-Agent Systems\" course. The goal of the project is the creation of ",
        "a multi-agent system using JADE technology. The program implements a maze game, where \"agents\" of the ",
        "program are collaborating to find the exit. In order for the goal to be accomplished, the algorithms ",
        "\"Best-First Search\" and \"A* Search\" are, also, being used."
      ],
      "href": {
        "message": "Please, find more information about the project:",
        "fa": "<i class='fas fa-external-link-alt'></i>",
        "link": "https://sseficha.github.io/AgentsProject/"
      },
      "date": "December 2019"
    },
    {
      "title": "LateX Document Template",
      "text": [
        "Document template in LaTeX, that is suitable for assignments, reports, theses, or similar papers that ",
        "are written in Greek.",
        "<br>",
        "<br>",
        "\"LaTeX is a high-quality typesetting system; it includes features designed for the production of technical ",
        "and scientific documentation. LaTeX is the de facto standard for the communication and publication of ",
        "scientific documents.\"",
        "<a href='https://www.latex-project.org/' target='_blank' class='text-info blockquote-footer'>The LaTeX Project</a>"
      ],
      "href": {
        "message": "Please, find more information about the template:",
        "fa": "<i class='fas fa-external-link-alt'></i>",
        "link": "https://bit.ly/3jUZ51J"
      },
      "date": "July 2020"
    },
    {
      "title": "S-DES Algorithm Implementation (Python)",
      "text": [
        "Bachelor level project during \"Network Security\" course. The goal of the project is the implementation of ",
        "the cryptography algorithm named S-DES. Also, the project includes the decoding procedure of a message."
      ],
      "href": {
        "message": "Please, find more information about the project:",
        "fa": "<i class='fas fa-external-link-alt'></i>",
        "link": "https://theathral.github.io/S-DES/"
      },
      "date": "September 2020"
    }
  ]
}