{
  "title": "Δείγμα Δουλειάς",
  "subtext": "Παρακάτω, παραθέτονται οι κυριότερες εργασίες στις οποίες είχα συμμετοχή κατά σειρά σημαντικότητας.",
  "contents": [
    {
      "title": "Octopus",
      "text": [
        "Η εφαρμογή \"Octopus\" είναι ένα σύστημα διαχείρισης συμβάντων εντός μίας μικρής επιχείρησης. ",
        "Περιέχει ομάδες όπου μπορεί να ενταχθεί ένας χρήστης και να αποκτήσει πρόσβαση σε δυνατότητες της εφαρμογής. ",
        "Οι χρήστες, αν το επιτρέπουν τα δικαιώματά τους, δύνανται να πραγματοποιήσουν τις παρακάτω ενέργειες:",
        "<ul>",
        "<li>Διαχείριση Συμβάντων και Αιτημάτων (Υποβολή, Παρακολούθηση Καταστάσεων, Ολοκλήρωση)</li>",
        "<li>Παρακολούθηση Στατιστικών Εφαρμογής</li>",
        "<li>Συνομιλία μεταξύ Χρηστών</li>",
        "<li>Δημιουργία Ρόλων και Δικαιωμάτων</li>",
        "<li>Παρακολούθηση Αρχείου Καταγραφών</li>",
        "</ul>",
        "<br>",
        "Προσφέρεται ως SaaS, ενώ έχει υλοποιηθεί σε γλώσσα προγραμματισμού \"Laravel\" για μεγαλύτερη ",
        "ασφάλεια.",
        "<br>",
        "<br>",
        "Το παραπάνω σύστημα έγινε σε συνεργασία με τον ",
        "<a href='https://nmanoukidis.netzapping.gr/' target='_blank' class='text-info'>Νικόλαο Μανουκίδη</a>."
      ],
      "href": {
        "message": "Βρείτε περισσότερες πληροφορίες για το \"Octopus\":",
        "fa": "<i class='fas fa-external-link-alt'></i>",
        "link": ""
      },
      "date": "Νοέμβριος 2020 - Σήμερα"
    },
    {
      "title": "Πτυχιακή Εργασία",
      "text": [
        "Η πτυχιακή μου εργασία συνετάχθη κατά τη διάρκεια του προγράμματος Erasmus με θέμα ",
        "<strong>\"Measuring Parent Centrality in Java Packages\"</strong>. Επιβλέπων ήταν ο Καθηγητής Paris Avgeriou ",
        "από το Πανεπιστήμιο του Groningen. Συγκεκριμένα, η πτυχιακή πραγματεύεται την εφαρμογή μια γνωστής μετρικής στους ",
        "τεχνολόγους πληροφορικής, <strong>Parent Centrality</strong>, σε ένα υπάρχον εργαλείο, <strong>ASTracker</strong>. ",
        "Επιπροσθέτως, η εργασία ερμηνεύει τα αποτελέσματα για να αποφανθεί αν η μετρική είναι χρήσιμη.",
        "<br>",
        "Οι ειδικοί στην τεχνολογία λογισμικού γνωρίζουν ότι μέσα στον πηγαίο κώδικα ενός προγράμματος υπάρχουν κάποιες ",
        "συνιστώσες όπου μπορούν να προκαλέσουν προβλήματα κατά την συντήρηση ή την επέκτασή του. Η μετρική Parent Centrality ",
        "όπου προτάθηκε από τον H. A. Al-Mutawa παρατηρεί πως αν υπάρχουν επιπλέον χαρακτηριστικά σε αυτά τα \"επιβλαβή\" ",
        "στοιχεία, τα μετατρέπει σε \"αβλαβή\".",
        "<br>",
        "Μετά την ανάλυση μιας ομάδας προγραμμάτων ανοιχτού κώδικα σε Java, επιβεβαιώσαμε τον ισχυρισμό του H. A. Al-Mutawa ",
        "καθώς τα αποτελέσματά μας αντιστοιχίζονται με τα δικά του."
      ],
      "href": {
        "message": "Παρακαλώ βρείτε το αρχείο της πτυχιακής μου εργασίας (μόνο στα αγγλικά):",
        "fa": "<i class='fas fa-file-pdf'></i>",
        "link": "portfolio/Bachelor Thesis.zip"
      },
      "date": "Φεβρουάριος 2020 - Ιούνιος 2020"
    },
    {
      "title": "Ιστοσελίδα Εφημερευόντων Νοσοκομείων (Flask)",
      "text": [
        "Εργασία προπτυχιακού επιπέδου κατά την διάρκεια του μαθήματος \"Πληροφοριακά Συστήματα Παγκόσμιου Ιστού\". ",
        "Σκοπός της εργασίας είναι η υλοποίηση μιας ιστοσελίδας, η οποία απεικονίζει σε πραγματικό χρόνο τα ",
        "εφημερεύοντα νοσοκομεία της Ελλάδος, καθώς και τρόπους επικοινωνίας με αυτά. Επίσης, στην ιστοσελίδα, ο ",
        "χρήστης έχει τη δυνατότητα να αποκομίσει πληροφορίες σχετικά με τον COVID-19."
      ],
      "href": {
        "message": "Βρείτε περισσότερες πληροφορίες για την εργασία:",
        "fa": "<i class='fas fa-external-link-alt'></i>",
        "link": "https://theathral.github.io/WebInformationSystems/"
      },
      "date": "Μάιος 2020"
    },
    {
      "title": "Διάγραμμα PERT & Οικονομική Ανάλυση Έργων",
      "text": [
        "Εργασία προπτυχιακού επιπέδου κατά την διάρκεια του μαθήματος \"Διασφάλιση Ποιότητας Συστημάτων Λογισμικού\". ",
        "Σκοπός της εργασίας είναι η σχεδίαση ενός διαγράμματος PERT για την υλοποίηση ενός έργου, με δεδομένους ",
        "τους χρόνους των επίμέρους εργασιών, καθώς και ανάλυση των αποτελεσμάτων.",
        "<br>",
        "Η δεύτερη άσκηση της εργασίας περιλαμβάνει επιλογή και οικονομική ανάλυση δύο έργων βάσει της ",
        "\"Απόδοση Επένδυσης\" (Return on Investment) σε βάθος 7 ετών."
      ],
      "href": {
        "message": "Παρακαλώ, βρείτε την εκφώνηση και την λύση της εργασίας (μόνο στα ελληνικά):",
        "fa": "<i class='fas fa-file-pdf'></i>",
        "link": "portfolio/PERT Project.zip"
      },
      "date": "Δεκέμβριος 2019"
    },
    {
      "title": "Εύρεση Διαρροής Φρεατίων (CLIPS)",
      "text": [
        "Εργασία προπτυχιακού επιπέδου κατά την διάρκεια του μαθήματος \"Συστήματα Γνώσης\". Σκοπός της εργασίας, ",
        "είναι η δημιουργία ενός έμπειρου συστήματος γνώσης σε γλώσσα CLIPS, που να συμπεραίνει την τοποθεσία μιας ",
        "βλάβης σε ένα εργοστάσιο, βάσει μετρήσεων που καταχωρούνται στο σύστημα. Επίσης, αποτυπώνει μία δοσμένη ",
        "τοπολογία φρεατίων και αποθηκών, καθώς και τα χαρακτηριστικά ορισμένων χημικών στοιχείων, ώστε να οδηγηθεί ",
        "σε κάποιο συμπέρασμα."
      ],
      "href": {
        "message": "Παρακαλώ, βρείτε περισσότερες πληροφορίες για την εργασία:",
        "fa": "<i class='fas fa-external-link-alt'></i>",
        "link": "https://theathral.github.io/manholeCLIPS/"
      },
      "date": "Δεκέμβριος 2019"
    },
    {
      "title": "Επίλυση Λαβυρίθνου (JADE)",
      "text": [
        "Εργασία προπτυχιακού επιπέδου κατά τη διάρκεια του μαθήματος \"Συστήματα Πολλαπλών Πρακτόρων\". Σκοπός της ",
        "εργασίας είναι η δημιουργία ενός συστήματος πολλαπλών πρακτόρων με την τεχνολογία JADE. Το πρόγραμμα ",
        "υλοποιεί ένα παιχνίδι λαβυρίνθου, όπου \"πράκτορες\" (Agents) του συστήματος συνεργάζονται για να βρουν ",
        "την έξοδο. Για να επιτευχθεί το παραπάνω, χρησιμοποιούνται επιπλέον οι αλγόριθμοι \"Best-First Search\" ",
        "και \"A* Search\"."
      ],
      "href": {
        "message": "Παρακαλώ, βρείτε περισσότερες πληροφορίες για την εργασία:",
        "fa": "<i class='fas fa-external-link-alt'></i>",
        "link": "https://sseficha.github.io/AgentsProject/"
      },
      "date": "Δεκέμβριος 2019"
    },
    {
      "title": "Πρότυπο Έγγραφο για Latex",
      "text": [
        "Πρότυπο έγγραφο για LaTeX, κατάλληλο για εργασίες, αναφορές, πτυχιακές, ή παρόμοια papers που έχουν ",
        "συνταχθεί στα ελληνικά.",
        "<br>",
        "<br>",
        "\"Η LaTeX είναι ένα σύστημα υψηλής ποιότητας στοιχειοθεσίας∙ περιέχει χαρακτηριστικά για την παραγωγή ",
        "τεχνικών και επιστημονικών εγχειριδίων. Η LaTeX είναι το de facto πρότυπο για την επικοινωνία και την ",
        "δημοσίευση επιστημωνικών εγγράφων.\"",
        "<a href='https://www.latex-project.org/' target='_blank' class='text-info blockquote-footer'>The LaTeX Project</a>"
      ],
      "href": {
        "message": "Παρακαλώ, βρείτε περισσότερες πληροφορίες για τΟ πρότυπο:",
        "fa": "<i class='fas fa-external-link-alt'></i>",
        "link": "https://bit.ly/3jUZ51J"
      },
      "date": "Ιούλιος 2020"
    },
    {
      "title": "Υλοποίηση Αλγορίθμου S-DES (Python)",
      "text": [
        "Εργασία προπτυχιακού επιπέδου κατά τη διάρκεια του μαθήματος \"Ασφάλεια Δικτύων\". Σκοπός της εργασίας είναι ",
        "η υλοποίηση του αλγορίθμου κρυπτογράφησης S-DES. Επίσης, στην εργασία περιλαμβάνεται και η διαδικασία ",
        "αποκρυπτογράφησης μηνύματος."
      ],
      "href": {
        "message": "Παρακαλώ, βρείτε περισσότερες πληροφορίες για την εργασία:",
        "fa": "<i class='fas fa-external-link-alt'></i>",
        "link": "https://theathral.github.io/S-DES/"
      },
      "date": "Σεπτέμβριος 2020"
    }
  ]
}